In [459]:
# Importing Dependancies

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from datetime import datetime

In [460]:
# Loading/Reading csv Dataset into Dataframe
df = pd.read_csv(r"C:\Users\Home\Desktop\10 Alytics  Data Engineering\Sales_Dataset_Capstone_Project_Nov_2025\Sales Dataset.csv")
df.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode,Order Date,CustomerName,State,City,Year-Month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [461]:
df.columns

Index(['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
       'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City',
       'Year-Month'],
      dtype='object')

In [462]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [463]:
df.columns = (
    df.columns.str.strip()
              .str.lower()                
              .str.replace(' ', '_',  regex=True)
)
df.head()

,order_id,amount,profit,quantity,category,sub-category,paymentmode,order_date,customername,state,city,year-month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [464]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub-category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year-month'],
      dtype='object')

In [465]:
# Convert to lowercase and replace spaces/dashes with underscore
df.columns = ['Order ID', 'Amount', 'Profit', 'Quantity', 'Category', 'Sub-Category',
           'PaymentMode', 'Order Date', 'CustomerName', 'State', 'City', 'Year-Month']

df.columns  = df.columns.str.lower().str.replace(' ', '_').str.replace('-', '_')

df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [466]:
#categories  table
category_df = df[['category', 'sub_category']].drop_duplicates().reset_index(drop=True)
category_df['category_id'] = category_df.index + 1
category_df = category_df[['category_id', 'category', 'sub_category']]


#category_df = df[['category']].reset_index(drop=True)
#category_df['category_id'] = category_df.index + 1
#category_df =  category_df[['category','sub_category']]

In [467]:
category_df

    category_id         category      sub_category
0             1      Electronics  Electronic Games
1             2      Electronics          Printers
2             3  Office Supplies              Pens
3             4      Electronics           Laptops
4             5        Furniture            Tables
5             6        Furniture            Chairs
6             7  Office Supplies           Markers
7             8        Furniture             Sofas
8             9  Office Supplies             Paper
9            10  Office Supplies           Binders
10           11      Electronics            Phones
11           12        Furniture         Bookcases

In [468]:
# customers table

#customer_df = df[['customername']].reset_index(drop=True)
#customer_df['customer_id'] = customer_df.index + 1
#customer_df = customer_df[['customer_id', 'customername', 'state', 'city']]

customer_df = df[['customername', 'state', 'city']].drop_duplicates().reset_index(drop=True)
customer_df['customer_id'] = customer_df.index + 1
customer_df = customer_df[['customer_id', 'customername', 'state', 'city']]

In [469]:
customer_df

     customer_id        customername     state           city
0              1       David Padilla   Florida          Miami
1              2       Connor Morgan  Illinois        Chicago
2              3        Robert Stone  New York        Buffalo
3              4         John Fields   Florida        Orlando
4              5       Clayton Smith   Florida          Miami
..           ...                 ...       ...            ...
802          803        Megan Mclean  New York  New York City
803          804        Caitlin Hunt  New York      Rochester
804          805       Jenna Holland     Texas         Austin
805          806  Stephanie Oconnell  New York        Buffalo
806          807         Andrea Hill  Illinois        Chicago

[807 rows x 4 columns]

In [470]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 807 entries, 0 to 806
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   807 non-null    int64
 1   customername  807 non-null    object
 2   state         807 non-null    object
 3   city          807 non-null    object
dtypes: int64(1), object(3)
memory usage: 25.3+ KB

In [471]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [472]:
# order table
order_df = df[['order_id', 'amount', 'profit', 'quantity', 'paymentmode', 'order_date', 'year_month']].drop_duplicates().reset_index(drop=True)
order_df['order_id'] = order_df.index + 1
order_df = order_df[['order_id', 'amount', 'profit', 'quantity', 'paymentmode', 'order_date', 'year_month']]

In [473]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     1194 non-null   int64
 1   amount       1194 non-null   int64
 2   profit       1194 non-null   int64
 3   quantity     1194 non-null   int64
 4   paymentmode  1194 non-null   object
 5   order_date   1194 non-null   object
 6   year_month   1194 non-null   object
dtypes: int64(4), object(3)
memory usage: 65.4+ KB

In [474]:
order_df

      order_id  amount  profit  quantity paymentmode  order_date year_month
0            1    9726    1275         5         UPI  2023-06-27    2023-06
1            2    9726    1275         5         UPI  2024-12-27    2024-12
2            3    9726    1275         5         UPI  2021-07-25    2021-07
3            4    4975    1330        14         UPI  2023-06-27    2023-06
4            5    4975    1330        14         UPI  2024-12-27    2024-12
...        ...     ...     ...       ...         ...         ...        ...
1189      1190    8825    3594        15  Debit Card  2024-07-31    2024-07
1190      1191    2082     642         8         EMI  2020-06-02    2020-06
1191      1192    2082     642         8         EMI  2022-12-15    2022-12
1192      1193    2082     642         8         EMI  2020-08-07    2020-08
1193      1194     914     163        13         UPI  2024-10-26    2024-10

[1194 rows x 7 columns]

In [475]:
import os
! pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\home\anaconda3\lib\site-packages (2.9.10)

In [476]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### database setup

In [477]:
import os
password = os.environ.get("Emuejevoke@@@3")

conn = psycopg2.connect(
    host="localhost",
    port=5432,
    user="postgres",
    password="Emuejevoke@@@3",
    dbname="sales_dataset_capstone_project"
)

### Connecting to PostgreSQL

In [478]:
connection_string = "postgresql://postgres:Emuejevoke%40%40%403@localhost:5432/sales_dataset_capstone_project"
engine = create_engine("postgresql+psycopg2://postgres:Emuejevoke%40%40%403@localhost:5432/sales_dataset_capstone_project")

### Testing Connection to PgAdmin(postgresql)

In [479]:
connection = engine.connect()
print("Connection successful!")
connection.close()

Connection successful!

In [480]:
df.describe()

            amount       profit     quantity
count  1194.000000  1194.000000  1194.000000
mean   5178.089615  1348.992462    10.674204
std    2804.921955  1117.992573     5.777102
min     508.000000    50.000000     1.000000
25%    2799.000000   410.000000     6.000000
50%    5152.000000  1014.000000    11.000000
75%    7626.000000  2035.000000    16.000000
max    9992.000000  4930.000000    20.000000

In [481]:
# category_df = pd.DataFrame({'year_month': ['2023-11', '2024-01', '2025-07']})
# category_df['year_month'] = pd.to_datetime(df['year_month'], format='%Y-%m')
# category_df

In [482]:
df.head()

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [483]:
df['date'] = pd.to_datetime(df['category'])
df['year_month'] = df['date'].dt.to_period('M')
monthly_avg = df.groupby('year_month')['category'].mean().reset_index()
monthly_avg.columns = ['year_month', 'avg_sales']
print(monthly_avg)

C:\Users\Home\AppData\Local\Temp\ipykernel_33900\1961913923.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['date'] = pd.to_datetime(df['category'])

DateParseError: Unknown datetime string format, unable to parse: Electronics, at position 0

In [484]:
print(df.columns)

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [485]:
df.tail()

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
1189,B-26370,8825,3594,15,Furniture,Tables,Debit Card,2024-07-31,Megan Mclean,New York,New York City,2024-07
1190,B-26298,2082,642,8,Electronics,Phones,EMI,2020-06-02,Caitlin Hunt,New York,Rochester,2020-06
1191,B-26298,2082,642,8,Electronics,Phones,EMI,2022-12-15,Jenna Holland,Texas,Austin,2022-12
1192,B-26298,2082,642,8,Electronics,Phones,EMI,2020-08-07,Stephanie Oconnell,New York,Buffalo,2020-08
1193,B-25068,914,163,13,Office Supplies,Markers,UPI,2024-10-26,Andrea Hill,Illinois,Chicago,2024-10

In [486]:
# Checking the shape of the DataFrame
df.shape

(1194, 12)

In [487]:
# Checking for missing values
df.isnull().sum()

order_id        0
amount          0
profit          0
quantity        0
category        0
sub_category    0
paymentmode     0
order_date      0
customername    0
state           0
city            0
year_month      0
dtype: int64

In [488]:
df.dtypes

order_id        object
amount           int64
profit           int64
quantity         int64
category        object
sub_category    object
paymentmode     object
order_date      object
customername    object
state           object
city            object
year_month      object
dtype: object

In [489]:
df.duplicated(subset=["category"]).mean()

0.9974874371859297

In [490]:
df.drop_duplicates()

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
...,...,...,...,...,...,...,...,...,...,...,...,...
1189,B-26370,8825,3594,15,Furniture,Tables,Debit Card,2024-07-31,Megan Mclean,New York,New York City,2024-07
1190,B-26298,2082,642,8,Electronics,Phones,EMI,2020-06-02,Caitlin Hunt,New York,Rochester,2020-06
1191,B-26298,2082,642,8,Electronics,Phones,EMI,2022-12-15,Jenna Holland,Texas,Austin,2022-12
1192,B-26298,2082,642,8,Electronics,Phones,EMI,2020-08-07,Stephanie Oconnell,New York,Buffalo,2020-08
1193,B-25068,914,163,13,Office Supplies,Markers,UPI,2024-10-26,Andrea Hill,Illinois,Chicago,2024-10

In [491]:
category_df.shape

(12, 3)

In [492]:
category_df.head()

   category_id         category      sub_category
0            1      Electronics  Electronic Games
1            2      Electronics          Printers
2            3  Office Supplies              Pens
3            4      Electronics           Laptops
4            5        Furniture            Tables

In [493]:
category_df

    category_id         category      sub_category
0             1      Electronics  Electronic Games
1             2      Electronics          Printers
2             3  Office Supplies              Pens
3             4      Electronics           Laptops
4             5        Furniture            Tables
5             6        Furniture            Chairs
6             7  Office Supplies           Markers
7             8        Furniture             Sofas
8             9  Office Supplies             Paper
9            10  Office Supplies           Binders
10           11      Electronics            Phones
11           12        Furniture         Bookcases

In [494]:
customer_df

     customer_id        customername     state           city
0              1       David Padilla   Florida          Miami
1              2       Connor Morgan  Illinois        Chicago
2              3        Robert Stone  New York        Buffalo
3              4         John Fields   Florida        Orlando
4              5       Clayton Smith   Florida          Miami
..           ...                 ...       ...            ...
802          803        Megan Mclean  New York  New York City
803          804        Caitlin Hunt  New York      Rochester
804          805       Jenna Holland     Texas         Austin
805          806  Stephanie Oconnell  New York        Buffalo
806          807         Andrea Hill  Illinois        Chicago

[807 rows x 4 columns]

In [495]:
order_df

      order_id  amount  profit  quantity paymentmode  order_date year_month
0            1    9726    1275         5         UPI  2023-06-27    2023-06
1            2    9726    1275         5         UPI  2024-12-27    2024-12
2            3    9726    1275         5         UPI  2021-07-25    2021-07
3            4    4975    1330        14         UPI  2023-06-27    2023-06
4            5    4975    1330        14         UPI  2024-12-27    2024-12
...        ...     ...     ...       ...         ...         ...        ...
1189      1190    8825    3594        15  Debit Card  2024-07-31    2024-07
1190      1191    2082     642         8         EMI  2020-06-02    2020-06
1191      1192    2082     642         8         EMI  2022-12-15    2022-12
1192      1193    2082     642         8         EMI  2020-08-07    2020-08
1193      1194     914     163        13         UPI  2024-10-26    2024-10

[1194 rows x 7 columns]

In [496]:
df

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
...,...,...,...,...,...,...,...,...,...,...,...,...
1189,B-26370,8825,3594,15,Furniture,Tables,Debit Card,2024-07-31,Megan Mclean,New York,New York City,2024-07
1190,B-26298,2082,642,8,Electronics,Phones,EMI,2020-06-02,Caitlin Hunt,New York,Rochester,2020-06
1191,B-26298,2082,642,8,Electronics,Phones,EMI,2022-12-15,Jenna Holland,Texas,Austin,2022-12
1192,B-26298,2082,642,8,Electronics,Phones,EMI,2020-08-07,Stephanie Oconnell,New York,Buffalo,2020-08
1193,B-25068,914,163,13,Office Supplies,Markers,UPI,2024-10-26,Andrea Hill,Illinois,Chicago,2024-10

In [497]:
# deducting Total amount from Total profit
column_range = df["amount"].sum() - df["profit"].sum()
column_range

4571942

In [498]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [499]:
df.category.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1194 entries, 0 to 1193
Series name: category
Non-Null Count  Dtype
--------------  -----
1194 non-null   object
dtypes: object(1)
memory usage: 9.5+ KB

In [500]:
df['category']

0           Electronics
1           Electronics
2           Electronics
3           Electronics
4           Electronics
             ...
1189          Furniture
1190        Electronics
1191        Electronics
1192        Electronics
1193    Office Supplies
Name: category, Length: 1194, dtype: object

In [517]:
# To list items in category column
# df['category'].tolist()

In [502]:
# Count of frequency of items in category 
df['category'].value_counts()

category
Furniture          407
Office Supplies    399
Electronics        388
Name: count, dtype: int64

In [503]:
# Calculating category maximum
df['category'].value_counts().max()

407

In [520]:
# Calculating category mean
df['category'].value_counts().mean()

398.0

In [504]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

### Order sorted from the most to least frequent

In [527]:
#  Order  sorted from the most to least frequent
frequency_counts = df.value_counts()
frequency_counts

order_id  amount  profit  quantity  category         sub_category      paymentmode  order_date  customername       state       city           year_month
B-25004   9965    3033    16        Office Supplies  Markers           COD          2020-06-17  Jennifer Marshall  California  San Francisco  2020-06       1
B-26324   6355    1335    15        Electronics      Electronic Games  Debit Card   2021-06-06  Keith Reese        Texas       Austin         2021-06       1
B-26321   2062    848     6         Office Supplies  Markers           Credit Card  2024-03-04  Christine Wheeler  Florida     Tampa          2024-03       1
B-26319   7748    1706    16        Electronics      Electronic Games  EMI          2020-05-02  Andrew Fernandez   Ohio        Cincinnati     2020-05       1
          6381    2763    20        Office Supplies  Markers           UPI          2020-05-02  Andrew Fernandez   Ohio        Cincinnati     2020-05       1
                                                                                                                                                           ..
B-25733   4569    1693    10        Electronics      Printers          UPI          2020-09-04  Manuel Stark       Illinois    Springfield    2020-09       1
B-25730   8293    2632    8         Office Supplies  Binders           COD          2023-08-21  Austin White       California  Los Angeles    2023-08       1
                                                                                    2022-01-05  Justin Rodriguez   Ohio        Cleveland      2022-01       1
                                                                                    2020-10-17  Ms. Emily Baxter   New York    Rochester      2020-10       1
B-26999   3756    1318    5         Furniture        Tables            UPI          2024-02-19  Edward Valencia    Florida     Miami          2024-02       1
Name: count, Length: 1194, dtype: int64

In [511]:
df['category']

0           Electronics
1           Electronics
2           Electronics
3           Electronics
4           Electronics
             ...
1189          Furniture
1190        Electronics
1191        Electronics
1192        Electronics
1193    Office Supplies
Name: category, Length: 1194, dtype: object

In [524]:
# Calculating category mean
avg = df['order_df'].mean()

KeyError: 'order_df'

In [525]:
order_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     1194 non-null   int64
 1   amount       1194 non-null   int64
 2   profit       1194 non-null   int64
 3   quantity     1194 non-null   int64
 4   paymentmode  1194 non-null   object
 5   order_date   1194 non-null   object
 6   year_month   1194 non-null   object
dtypes: int64(4), object(3)
memory usage: 65.4+ KB

In [526]:
df.head()

,order_id,amount,profit,quantity,category,sub_category,paymentmode,order_date,customername,state,city,year_month
0,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
1,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12
2,B-26776,9726,1275,5,Electronics,Electronic Games,UPI,2021-07-25,Robert Stone,New York,Buffalo,2021-07
3,B-26776,4975,1330,14,Electronics,Printers,UPI,2023-06-27,David Padilla,Florida,Miami,2023-06
4,B-26776,4975,1330,14,Electronics,Printers,UPI,2024-12-27,Connor Morgan,Illinois,Chicago,2024-12

In [529]:
# Calculating category mean
df['category'].value_counts().median()

399.0

In [537]:
df['state'].describe()

count         1194
unique           6
top       New York
freq           226
Name: state, dtype: object

In [547]:
  #  State with Minimum
df['state'].min()

'California'

In [545]:
 # Number of unique values
df['state'].nunique()

6

In [551]:
# Top customer
df['customername'].describe()

count                  1194
unique                  802
top       Michael Rodriguez
freq                      4
Name: customername, dtype: object

In [550]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [557]:
# Customer aggregate Minimum
df['customername'].agg(['min'])

min    Aaron Dunn
Name: customername, dtype: object

In [558]:
# City aggregate Minimum
df['city'].agg(['min'])

min    Austin
Name: city, dtype: object